In [2]:
import pandas as pd


print(pd.__version__)

1.3.4

In [3]:
data = { 'nama' : ['Didi Kempot', 'Glenn Fredly', 'Mbah Surip' ],
        'tempat_kelahiran' :['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojoker, Jawa Timue']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip     Mojoker, Jawa Timue

In [4]:
#memecah nam depan dan nama belakang dengan fungsi str_split
#split berfungsi memecah dengan kondisi (kontek yang dipakai adalah spasi)
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip     Mojoker, Jawa Timue       Mbah         Surip

In [5]:

#split berfungsi memecah dengan kondisi (kontek yang dipakai adalah tanda ,)
df[['kota','provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojoker, Jawa Timue",Mbah,Surip,Mojoker,Jawa Timue